## Production: api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 0 to change, 0 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.route53_resolver_logging_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "route53_resolver_logging_policy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "route53.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudwatch_log_group.route53_vpc_dns will be created
  + resource "aws_cloudwatch_log_group" "route53_vpc_dns" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/route53/vpc-04cc4c1a5a2e97d9a"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_resource_policy.route53_vpc_dns will be created
  + resource "aws_cloudwatch_log_resource_policy" "route53_vpc_dns" {
      + id              = (known after apply)
      + policy_document = (known after apply)
      + policy_name     = "route53_resolver_logging_policy"
    }

  # aws_route53_resolver_query_log_config.route53_vpc_dns will be created
  + resource "aws_route53_resolver_query_log_config" "route53_vpc_dns" {
      + arn             = (known after apply)
      + destination_arn = (known after apply)
      + id              = (known after apply)
      + name            = "route53_vpc_dns"
      + owner_id        = (known after apply)
      + share_status    = (known after apply)
      + tags_all        = (known after apply)
    }

  # aws_route53_resolver_query_log_config_association.route53_vpc_dns will be created
  + resource "aws_route53_resolver_query_log_config_association" "route53_vpc_dns" {
      + id                           = (known after apply)
      + resolver_query_log_config_id = (known after apply)
      + resource_id                  = "vpc-04cc4c1a5a2e97d9a"
    }

  # aws_vpc_endpoint.sns will be created
  + resource "aws_vpc_endpoint" "sns" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-089a1b12ba172c5e6",
        ]
      + service_name          = "com.amazonaws.ca-central-1.sns"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-011bc431a48c5fb24",
          + "subnet-0135ef683aa873b27",
          + "subnet-0cb54bcb064da8ff0",
        ]
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-04cc4c1a5a2e97d9a"

      + dns_options {
          + dns_record_ip_type = (known after apply)
        }
    }

  # aws_vpc_endpoint.sts will be created
  + resource "aws_vpc_endpoint" "sts" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-089a1b12ba172c5e6",
        ]
      + service_name          = "com.amazonaws.ca-central-1.sts"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-011bc431a48c5fb24",
          + "subnet-0135ef683aa873b27",
          + "subnet-0cb54bcb064da8ff0",
        ]
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-04cc4c1a5a2e97d9a"

      + dns_options {
          + dns_record_ip_type = (known after apply)
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.clamav-defs.aws_s3_bucket.this,
  on .terraform/modules/clamav-defs/S3/main.tf line 7, in resource "aws_s3_bucket" "this":
   7: resource "aws_s3_bucket" "this" {

Use the top-level parameter object_lock_enabled and the
aws_s3_bucket_object_lock_configuration resource instead

(and 23 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_vpc_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_resolver_query_log_config.route53_vpc_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.ecr_api"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.ecr_dkr"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.sts"]

25 tests, 17 passed, 8 warnings, 0 failures, 0 exceptions

```

</details>
